Revit 2027 API
BuiltInFailures.CreationFailures.CannotMakeRoofFromVerticalFace Property
 Can't make roof from vertical face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMakeRoofFromVerticalFace { get; }
Public Shared ReadOnly Property CannotMakeRoofFromVerticalFace As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMakeRoofFromVerticalFace {
	FailureDefinitionId^ get ();
}
static member CannotMakeRoofFromVerticalFace : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace